app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `password`, `birthday`, `updated_at`, `created_at`) values ('userTest', 'test@gmail.com', '$2y$10$7/aSaWjrZ.zjtTB85KKMV.fkSO96ZIxSOZNweZCZ2JiLv0y6unYBq', '1111-11-11', '2024-04-28 19:06:55', '2024-04-28 19:06:55')
---
    protected function create(array $data)
    {
        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
            'birthday' => $data['birthday']
        ]);